#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//大端存储：数据的低位放在内存的高位，数据的高位放在地址的低位。
//小端存储：数据的低位放在内存的低位，数据的高位放在地址的高位。
//判断大小端
//int check_sys()
//{
//	int i = 1;
//	return *((char*)&i);
//}
//int main()
//{
//	int n = check_sys();
//	if (n)
//	{
//		printf("小端存储。\n");
//	}
//	else
//	{
//		printf("大端存储。\n");
//	}
//	return 0;
//}

//int main()
//{
//	char a = -1;//有符号
//	//10000001
//	//11111110
//	//11111111
//	signed char b = -1;//有符号
//	unsigned char c = -1;//无符号
//	//11111111
//	printf("a=%d,b=%d,c=%d", a, b, c);//-1 -1 255
//	return 0;
//}

//int main()
//{
//	char a = -128;
//10000000000000000000000010000000
//11111111111111111111111101111111
//11111111111111111111111110000000
//	printf("%u\n", a);//11111111111111111111111110000000为二进制的无符号类型
//	return 0;
//}

//int main()
//{
//	char a = 128;
//	//00000000000000000000000010000000
// 	printf("%u\n", a);//
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100
//	unsigned int j = 10;
//	//00000000000000000000000000001010
//	printf("%d\n", i + j);
//	//11111111111111111111111111110110
//	//11111111111111111111111111110101
//	//10000000000000000000000000001010
//	return 0;
//}


//int main()
//{
//	unsigned int i = 0;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("hehe\n");
//	}
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i;
//	//11111111 -1
//	//11111110 -2
//	//11111101 -3
//    //.......
//	//10000000 -128
//	//01111111 127
//	//....
//	//00000001 1
//	//00000000 0
//	for (i = 0; i<1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}
unsigned char i = 0;//范围 0到255
int main()
{
	for (i = 0; i <= 255; i++)
	{
		printf("hello world\n");
	}
	return 0;
}



